NCE2/L67 Volcanoes.org
#+OPTIONS: \n:t toc:nil num:nil html-postamble:nil
#+HTML_HEAD_EXTRA: <style>body {background: rgb(193, 230, 198) !important;}</style>
* Lesson 67 Volcanoes
#+begin_verse
Why does Tazieff risk his life like this?

Haroun Tazieff, the Polish scientist,
	has spent his lifetime studying active volcanoes and deep caves in all parts of the world.
In 1948, he went to Lake Kivu in the Congo to observe a new volcano which he later *named Kituro*.
Tazieff was able to *set up his camp* very close to the volcano while it was erupting violently.
Though he managed to take a number of brilliant photographs,
	he could not stay near the volcano for very long.
*He noticed that* a river of liquid rock was coming towards him.
It threatened to surround him completely,
	but Tazieff managed to escape just in time.
He waited until the volcano became quiet and he was able to return two days later.
This time, he managed to climb into the mouth of Kituro
	so that he could take photographs and measure temperatures.
Tazieff has often risked his life in this way.
He has been able to tell us more about active volcanoes than any man alive.
#+end_verse
** expression
volcano [vɑlˈkeɪnoʊ] n.火山
active [ˈæktɪv] adj.活动的
Kivu ['kivu] n. Congo ['kɒŋɡəʊ] n. Kituro n.
erupt [ɪˈrʌpt] v.(火山)喷发
violently [ˈvaɪələntli] adv. violent [ˈvaɪələnt] adj.猛烈地,剧烈地
manage [ˈmænɪdʒ] v.设法
brilliant [ˈbrɪljənt] adj.精彩的
liquid [ˈlɪkwɪd] adj.液态的
escape [ɪˈskeɪp] v.n.逃脱
alive [əˈlaɪv] adj.活着的

What a brilliant idea! 多棒的主意!
That's brilliant! 那太棒了
--------------------
managed to do VS was able to do 成功做成了某事(事例) VS ~ + 过去有能力做成某事

name sth. a. 命名某物为A
set up his camp/tent 搭起他的帐篷
sb. noticed that + sentence 某人注意到+...



** 单词造句
volcano n.
- I should have spent more time studying volcanoes.
- She is eager to see the volcano.
- Leo became an expert at volcanoes.
- If you had gone to the national park, you would have seen the famous volcano.
- Leo has been an expert at volcanoes.
active adj.
- If you had spent more time studying active volcanoes, you should have known this.
- Two years ago, you were a school prefect and active in the church.
- We ought to have learned more about active volcanoes.
- There is no creature living in the active volcano.
- I should have spent more time studying active volcanos.
erupt v.
- The active volcano should have erupted last night.
- It was very unfortunate that a few people were near the volcano when it erupted.
- An extinct volcano will not erupt at any time.
- He's very kind and will not erupt at any time.
- It's difficult to get along with a man who is like a volcano just waiting to erupt.
violently adv. violent adj.
- He got so angry that he shook violently.
- If you keep shaking your head so violently, you will be in hospital.
- The beggar knocked at the door violently.
- My wife has kicked my ass violently.
- She spent a lot of time kicking at the door violently.
brilliant adj.
- What a brilliant idea!
- That's brilliant!
- I had a brilliant plan. We can have our homework done.
- I have all kinds of brilliant plans in my head.
- Kobe is the most brilliant player I've ever known.
liquid adj.
- The ice has been turned into liquid.
- Stay away from the liquid rock, it's dangerous.
- If you had stayed away from the liquid rock, you wouldn't have been hurt.
- Have they been turned into liquid?
- Why have they been turned into liquid?
escape v.n.
- There is no escape from this/ here.
- If you try to escape, I will shoot you.
- The dog that my mom sent to me always tries to escape.
- The thieves had already escaped before the police came.
- If she had escaped from here, she would have been killed.
alive adj.
- He is still alive.
- If my grandfather had been alive, he would have seen my son.
- He is a more popular lol player than anyone alive.
- Is he still alive?
- How did he manage to be alive?
** 反复听电影片段
** Pattern Drill 写+读
- see Tom
	 + Did you manage to see Tom yesterday?
	 + No, I won't be able to see him until next week.
- meet the manager
	 + Did you manage to meet the manager?
	 + No, I won't be able to meet him until next week.
- sell the tickets
	 + Did you manage to sell the tickets?
	 + No, I won't be able to sell them until next week.
- examine the cave
	 + Did you manage to examine the cave?
	 + No, I won't be able to examine it until next week.
- apply for the job
	 + Did you manage to apply for the job?
	 + No, I won't be able to apply for it until next week. 
** 给自己讲解
** 红皮书
** 习惯用法造句
- name sth. a.
	- He has escaped the house which he named Red Tower.
	- The poor girl managed to escape the house which named Red Tower.
	- It is fortunate that nobody was near the flood which named Dayu.
	- He named his cat Miumiu.
	- He named his cat Miumiu in the morning.
- set up his camp/tent
	- If you had set up the tent, we would have been asleep.
	- You should have set up the tent.
	- A search party set up their camp in the village.
	- A search party set up their camp in which village they named RedTu.
	- A search party was setting up their camp when a puma stared at them.
- sb. noticed that + 句子
	- He noticed that he should have spent more time doing housework.
	- I noticed that I had made a big mistake.
	- I noticed that my cat was waiting for me.
	- I noticed that I should have finished in time.
	- I noticed that Leo had become an expert in English.
** 跟读至背诵
** Ask me if 写+读
1. Haroun Tazieff is Polish.(What nationality)
	 What nationality is Haroun Tazieff's?
2. He is a scientist.(What)
		What's his job?
3. He studies active volcanoes.(What)
		What does he study?
4. He also studies deep caves.(What else)
		What else does he study?
5. He's been in all parts of the world.(Where)(Who)
		Where has he been?
		Who has been in all parts of the world?
6. He went to Lake Kivu in 1948.(When)
	 When did he go to Lake Kiku?
7. It's in the Congo.(Where)(What)
	 Where is it?
	 What's in the Congo?
8. He went to observe a new volcano.(Why)
	 Why did he go to observe a new volcano?
9. He later named it Kituro.(What)
	 What did he later name it?
10. He was able to set up his camp very close to the volcano.(Where)
		Where was he able to set up his camp?
1- It was erupting violently.(What)
		What was erupting violently?
** 摘要写作
Tazieff, the Polish scientist, went to Lake Kiku in the Congo to observe a new volcano in 1948
	which he later named Kituro.
After taking photographs,
	he had to leave almost at once because a river of liquid rock threatened to surround him.
He escaped just in time, but he returned two days later when the volcano became quite.
He climbed into the mouth of Kituro this time
	in order to take photographs and measure temperatures.
** tell the story 口语
** Topics for discussion
- Have you ever seen a volcano/been into a deep cave? Describe your experience.
	 我在金华去过一次溶洞.里面很漂亮,有很多的钟乳石.我们还看到了一群蝙蝠.
- Suppose that you were going to become a professional photographer.
	 What subjects would you choose to photograph and why?
	 人体. For pleasure
- Should people risk their lives to study volcanoes? What is your opinion?
	 首先非常崇敬他们,但就我个人而言,是不愿意牺牲自己生命的.
