English/NCE2/L67 Volcanoes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-06 Tue 22:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-orgb445abd" class="outline-2">
<h2 id="orgb445abd">Lesson 67 Volcanoes</h2>
<div class="outline-text-2" id="text-orgb445abd">
<p class="verse">
Why does Tazieff risk his life like this?<br />
<br />
Haroun Tazieff, the Polish scientist,<br />
&#xa0;has spent his lifetime studying active volcanoes and deep caves in all parts of the world.<br />
In 1948, he went to Lake Kivu in the Congo to observe a new volcano which he later <b>named Kituro</b>.<br />
Tazieff was able to <b>set up his camp</b> very close to the volcano while it was erupting violently.<br />
Though he managed to take a number of brilliant photographs,<br />
&#xa0;he could not stay near the volcano for very long.<br />
<b>He noticed that</b> a river of liquid rock was coming towards him.<br />
It threatened to surround him completely,<br />
&#xa0;but Tazieff managed to escape just in time.<br />
He waited until the volcano became quiet and he was able to return two days later.<br />
This time, he managed to climb into the mouth of Kituro<br />
&#xa0;so that he could take photographs and measure temperatures.<br />
Tazieff has often risked his life in this way.<br />
He has been able to tell us more about active volcanoes than any man alive.<br />
</p>
</div>
<div id="outline-container-org8ecdadc" class="outline-3">
<h3 id="org8ecdadc">expression</h3>
<div class="outline-text-3" id="text-org8ecdadc">
<p>
volcano [vɑlˈkeɪnoʊ] n.火山<br />
active [ˈæktɪv] adj.活动的<br />
Kivu ['kivu] n. Congo ['kɒŋɡəʊ] n. Kituro n.<br />
erupt [ɪˈrʌpt] v.(火山)喷发<br />
violently [ˈvaɪələntli] adv. violent [ˈvaɪələnt] adj.猛烈地,剧烈地<br />
manage [ˈmænɪdʒ] v.设法<br />
brilliant [ˈbrɪljənt] adj.精彩的<br />
liquid [ˈlɪkwɪd] adj.液态的<br />
escape [ɪˈskeɪp] v.n.逃脱<br />
alive [əˈlaɪv] adj.活着的<br />
</p>

<p>
What a brilliant idea! 多棒的主意!<br />
That's brilliant! 那太棒了<br />
</p>
<hr />
<p>
managed to do VS was able to do 成功做成了某事(事例) VS ~ + 过去有能力做成某事<br />
</p>

<p>
name sth. a. 命名某物为A<br />
set up his camp/tent 搭起他的帐篷<br />
sb. noticed that + sentence 某人注意到+&#x2026;<br />
</p>
</div>
</div>



<div id="outline-container-org6562a49" class="outline-3">
<h3 id="org6562a49">单词造句</h3>
<div class="outline-text-3" id="text-org6562a49">
<p>
volcano n.<br />
</p>
<ul class="org-ul">
<li>I should have spent more time studying volcanoes.<br /></li>
<li>She is eager to see the volcano.<br /></li>
<li>Leo became an expert at volcanoes.<br /></li>
<li>If you had gone to the national park, you would have seen the famous volcano.<br /></li>
<li>Leo has been an expert at volcanoes.<br /></li>
</ul>
<p>
active adj.<br />
</p>
<ul class="org-ul">
<li>If you had spent more time studying active volcanoes, you should have known this.<br /></li>
<li>Two years ago, you were a school prefect and active in the church.<br /></li>
<li>We ought to have learned more about active volcanoes.<br /></li>
<li>There is no creature living in the active volcano.<br /></li>
<li>I should have spent more time studying active volcanos.<br /></li>
</ul>
<p>
erupt v.<br />
</p>
<ul class="org-ul">
<li>The active volcano should have erupted last night.<br /></li>
<li>It was very unfortunate that a few people were near the volcano when it erupted.<br /></li>
<li>An extinct volcano will not erupt at any time.<br /></li>
<li>He's very kind and will not erupt at any time.<br /></li>
<li>It's difficult to get along with a man who is like a volcano just waiting to erupt.<br /></li>
</ul>
<p>
violently adv. violent adj.<br />
</p>
<ul class="org-ul">
<li>He got so angry that he shook violently.<br /></li>
<li>If you keep shaking your head so violently, you will be in hospital.<br /></li>
<li>The beggar knocked at the door violently.<br /></li>
<li>My wife has kicked my ass violently.<br /></li>
<li>She spent a lot of time kicking at the door violently.<br /></li>
</ul>
<p>
brilliant adj.<br />
</p>
<ul class="org-ul">
<li>What a brilliant idea!<br /></li>
<li>That's brilliant!<br /></li>
<li>I had a brilliant plan. We can have our homework done.<br /></li>
<li>I have all kinds of brilliant plans in my head.<br /></li>
<li>Kobe is the most brilliant player I've ever known.<br /></li>
</ul>
<p>
liquid adj.<br />
</p>
<ul class="org-ul">
<li>The ice has been turned into liquid.<br /></li>
<li>Stay away from the liquid rock, it's dangerous.<br /></li>
<li>If you had stayed away from the liquid rock, you wouldn't have been hurt.<br /></li>
<li>Have they been turned into liquid?<br /></li>
<li>Why have they been turned into liquid?<br /></li>
</ul>
<p>
escape v.n.<br />
</p>
<ul class="org-ul">
<li>There is no escape from this/ here.<br /></li>
<li>If you try to escape, I will shoot you.<br /></li>
<li>The dog that my mom sent to me always tries to escape.<br /></li>
<li>The thieves had already escaped before the police came.<br /></li>
<li>If she had escaped from here, she would have been killed.<br /></li>
</ul>
<p>
alive adj.<br />
</p>
<ul class="org-ul">
<li>He is still alive.<br /></li>
<li>If my grandfather had been alive, he would have seen my son.<br /></li>
<li>He is a more popular lol player than anyone alive.<br /></li>
<li>Is he still alive?<br /></li>
<li>How did he manage to be alive?<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orge7fab01" class="outline-3">
<h3 id="orge7fab01">反复听电影片段</h3>
</div>
<div id="outline-container-org06f0a31" class="outline-3">
<h3 id="org06f0a31">Pattern Drill 写+读</h3>
<div class="outline-text-3" id="text-org06f0a31">
<ul class="org-ul">
<li>see Tom<br />
<ul class="org-ul">
<li>Did you manage to see Tom yesterday?<br /></li>
<li>No, I won't be able to see him until next week.<br /></li>
</ul></li>
<li>meet the manager<br />
<ul class="org-ul">
<li>Did you manage to meet the manager?<br /></li>
<li>No, I won't be able to meet him until next week.<br /></li>
</ul></li>
<li>sell the tickets<br />
<ul class="org-ul">
<li>Did you manage to sell the tickets?<br /></li>
<li>No, I won't be able to sell them until next week.<br /></li>
</ul></li>
<li>examine the cave<br />
<ul class="org-ul">
<li>Did you manage to examine the cave?<br /></li>
<li>No, I won't be able to examine it until next week.<br /></li>
</ul></li>
<li>apply for the job<br />
<ul class="org-ul">
<li>Did you manage to apply for the job?<br /></li>
<li>No, I won't be able to apply for it until next week.<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgd74f4c8" class="outline-3">
<h3 id="orgd74f4c8">给自己讲解</h3>
</div>
<div id="outline-container-org97c59d6" class="outline-3">
<h3 id="org97c59d6">红皮书</h3>
</div>
<div id="outline-container-org85fb31a" class="outline-3">
<h3 id="org85fb31a">习惯用法造句</h3>
<div class="outline-text-3" id="text-org85fb31a">
<ul class="org-ul">
<li>name sth. a.<br />
<ul class="org-ul">
<li>He has escaped the house which he named Red Tower.<br /></li>
<li>The poor girl managed to escape the house which named Red Tower.<br /></li>
<li>It is fortunate that nobody was near the flood which named Dayu.<br /></li>
<li>He named his cat Miumiu.<br /></li>
<li>He named his cat Miumiu in the morning.<br /></li>
</ul></li>
<li>set up his camp/tent<br />
<ul class="org-ul">
<li>If you had set up the tent, we would have been asleep.<br /></li>
<li>You should have set up the tent.<br /></li>
<li>A search party set up their camp in the village.<br /></li>
<li>A search party set up their camp in which village they named RedTu.<br /></li>
<li>A search party was setting up their camp when a puma stared at them.<br /></li>
</ul></li>
<li>sb. noticed that + 句子<br />
<ul class="org-ul">
<li>He noticed that he should have spent more time doing housework.<br /></li>
<li>I noticed that I had made a big mistake.<br /></li>
<li>I noticed that my cat was waiting for me.<br /></li>
<li>I noticed that I should have finished in time.<br /></li>
<li>I noticed that Leo had become an expert in English.<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org666a168" class="outline-3">
<h3 id="org666a168">跟读至背诵</h3>
</div>
<div id="outline-container-orgcbb6a5e" class="outline-3">
<h3 id="orgcbb6a5e">Ask me if 写+读</h3>
<div class="outline-text-3" id="text-orgcbb6a5e">
<ol class="org-ol">
<li>Haroun Tazieff is Polish.(What nationality)<br />
What nationality is Haroun Tazieff's?<br /></li>
<li>He is a scientist.(What)<br />
What's his job?<br /></li>
<li>He studies active volcanoes.(What)<br />
What does he study?<br /></li>
<li>He also studies deep caves.(What else)<br />
What else does he study?<br /></li>
<li>He's been in all parts of the world.(Where)(Who)<br />
Where has he been?<br />
Who has been in all parts of the world?<br /></li>
<li>He went to Lake Kivu in 1948.(When)<br />
When did he go to Lake Kiku?<br /></li>
<li>It's in the Congo.(Where)(What)<br />
Where is it?<br />
What's in the Congo?<br /></li>
<li>He went to observe a new volcano.(Why)<br />
Why did he go to observe a new volcano?<br /></li>
<li>He later named it Kituro.(What)<br />
What did he later name it?<br /></li>
<li>He was able to set up his camp very close to the volcano.(Where)<br />
Where was he able to set up his camp?<br /></li>
</ol>
<p>
1- It was erupting violently.(What)<br />
		What was erupting violently?<br />
</p>
</div>
</div>
<div id="outline-container-orgf166950" class="outline-3">
<h3 id="orgf166950">摘要写作</h3>
<div class="outline-text-3" id="text-orgf166950">
<p>
Tazieff, the Polish scientist, went to Lake Kiku in the Congo to observe a new volcano in 1948<br />
	which he later named Kituro.<br />
After taking photographs,<br />
	he had to leave almost at once because a river of liquid rock threatened to surround him.<br />
He escaped just in time, but he returned two days later when the volcano became quite.<br />
He climbed into the mouth of Kituro this time<br />
	in order to take photographs and measure temperatures.<br />
</p>
</div>
</div>
<div id="outline-container-org66f63e4" class="outline-3">
<h3 id="org66f63e4">tell the story 口语</h3>
</div>
<div id="outline-container-org126799a" class="outline-3">
<h3 id="org126799a">Topics for discussion</h3>
<div class="outline-text-3" id="text-org126799a">
<ul class="org-ul">
<li>Have you ever seen a volcano/been into a deep cave? Describe your experience.<br />
我在金华去过一次溶洞.里面很漂亮,有很多的钟乳石.我们还看到了一群蝙蝠.<br /></li>
<li>Suppose that you were going to become a professional photographer.<br />
What subjects would you choose to photograph and why?<br />
人体. For pleasure<br /></li>
<li>Should people risk their lives to study volcanoes? What is your opinion?<br />
首先非常崇敬他们,但就我个人而言,是不愿意牺牲自己生命的.<br /></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
